avr-rust/avrd/packs/xmegaa/ATxmega64A1U.atdf
        <register caption="Address Register" name="ADDR" offset="0x03" size="1">
          <bitfield caption="Device Address" mask="0x7F" name="ADDR"/>
        </register>
        <register caption="FIFO Write Pointer Register" name="FIFOWP" offset="0x04" size="1">
          <bitfield caption="FIFO Write Pointer" mask="0x1F" name="FIFOWP"/>
        </register>
        <register caption="FIFO Read Pointer Register" name="FIFORP" offset="0x05" size="1">
          <bitfield caption="FIFO Read Pointer" mask="0x1F" name="FIFORP"/>
        </register>
        <register caption="Endpoint Configuration Table Pointer" name="EPPTR" offset="0x06" size="2"/>
        <register caption="Interrupt Control Register A" name="INTCTRLA" offset="0x08" size="1">
          <bitfield caption="Start Of Frame Interrupt Enable" mask="0x80" name="SOFIE"/>
          <bitfield caption="Bus Event Interrupt Enable" mask="0x40" name="BUSEVIE"/>
          <bitfield caption="Bus Error Interrupt Enable" mask="0x20" name="BUSERRIE"/>
          <bitfield caption="STALL Interrupt Enable" mask="0x10" name="STALLIE"/>
          <bitfield caption="Interrupt Level" mask="0x03" name="INTLVL" values="USB_INTLVL"/>
        </register>
        <register caption="Interrupt Control Register B" name="INTCTRLB" offset="0x09" size="1">
          <bitfield caption="Transaction Complete Interrupt Enable" mask="0x02" name="TRNIE"/>
          <bitfield caption="SETUP Transaction Complete Interrupt Enable" mask="0x01" name="SETUPIE"/>
        </register>
        <register caption="Clear Interrupt Flag Register A" name="INTFLAGSACLR" offset="0x0A" size="1">
          <bitfield caption="Start Of Frame Interrupt Flag" mask="0x80" name="SOFIF"/>
          <bitfield caption="Suspend Interrupt Flag" mask="0x40" name="SUSPENDIF"/>
          <bitfield caption="Resume Interrupt Flag" mask="0x20" name="RESUMEIF"/>
          <bitfield caption="Reset Interrupt Flag" mask="0x10" name="RSTIF"/>
          <bitfield caption="Isochronous CRC Error Interrupt Flag" mask="0x08" name="CRCIF"/>
          <bitfield caption="Underflow Interrupt Flag" mask="0x04" name="UNFIF"/>
          <bitfield caption="Overflow Interrupt Flag" mask="0x02" name="OVFIF"/>
          <bitfield caption="STALL Interrupt Flag" mask="0x01" name="STALLIF"/>
        </register>
        <register caption="Set Interrupt Flag Register A" name="INTFLAGSASET" offset="0x0B" size="1">
          <bitfield caption="Start Of Frame Interrupt Flag" mask="0x80" name="SOFIF"/>
          <bitfield caption="Suspend Interrupt Flag" mask="0x40" name="SUSPENDIF"/>
          <bitfield caption="Resume Interrupt Flag" mask="0x20" name="RESUMEIF"/>
          <bitfield caption="Reset Interrupt Flag" mask="0x10" name="RSTIF"/>
          <bitfield caption="Isochronous CRC Error Interrupt Flag" mask="0x08" name="CRCIF"/>
          <bitfield caption="Underflow Interrupt Flag" mask="0x04" name="UNFIF"/>
          <bitfield caption="Overflow Interrupt Flag" mask="0x02" name="OVFIF"/>
          <bitfield caption="STALL Interrupt Flag" mask="0x01" name="STALLIF"/>
        </register>
        <register caption="Clear Interrupt Flag Register B" name="INTFLAGSBCLR" offset="0x0C" size="1">
          <bitfield caption="Transaction Complete Interrupt Flag" mask="0x02" name="TRNIF"/>
          <bitfield caption="SETUP Transaction Complete Interrupt Flag" mask="0x01" name="SETUPIF"/>
        </register>
        <register caption="Set Interrupt Flag Register B" name="INTFLAGSBSET" offset="0x0D" size="1">
          <bitfield caption="Transaction Complete Interrupt Flag" mask="0x02" name="TRNIF"/>
          <bitfield caption="SETUP Transaction Complete Interrupt Flag" mask="0x01" name="SETUPIF"/>
        </register>
        <register caption="Calibration Byte 0" name="CAL0" offset="0x3A" size="1"/>
        <register caption="Calibration Byte 1" name="CAL1" offset="0x3B" size="1"/>
      </register-group>
      <register-group caption="USB Endpoint Table" name="USB_EP_TABLE" size="274">
        <register caption="Frame Number Low Byte" name="FRAMENUML" offset="0x110" size="1"/>
        <register caption="Frame Number High Byte" name="FRAMENUMH" offset="0x111" size="1"/>
        <register-group caption="Endpoint 0" name="EP0OUT" offset="0x00" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 0" name="EP0IN" offset="0x08" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 1" name="EP1OUT" offset="0x10" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 1" name="EP1IN" offset="0x18" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 2" name="EP2OUT" offset="0x20" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 2" name="EP2IN" offset="0x28" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 3" name="EP3OUT" offset="0x30" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 3" name="EP3IN" offset="0x38" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 4" name="EP4OUT" offset="0x40" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 4" name="EP4IN" offset="0x48" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 5" name="EP5OUT" offset="0x50" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 5" name="EP5IN" offset="0x58" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 6" name="EP6OUT" offset="0x60" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 6" name="EP6IN" offset="0x68" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 7" name="EP7OUT" offset="0x70" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 7" name="EP7IN" offset="0x78" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 8" name="EP8OUT" offset="0x80" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 8" name="EP8IN" offset="0x88" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 9" name="EP9OUT" offset="0x90" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 9" name="EP9IN" offset="0x98" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 10" name="EP10OUT" offset="0xA0" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 10" name="EP10IN" offset="0xA8" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 11" name="EP11OUT" offset="0xB0" name-in-module="USB_EP"/>
