avr-rust/avrd/packs/xmegaa/ATxmega64A1U.atdf
        <register-group caption="Endpoint 11" name="EP11IN" offset="0xB8" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 12" name="EP12OUT" offset="0xC0" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 12" name="EP12IN" offset="0xC8" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 13" name="EP13OUT" offset="0xD0" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 13" name="EP13IN" offset="0xD8" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 14" name="EP14OUT" offset="0xE0" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 14" name="EP14IN" offset="0xE8" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 15" name="EP15OUT" offset="0xF0" name-in-module="USB_EP"/>
        <register-group caption="Endpoint 15" name="EP15IN" offset="0xF8" name-in-module="USB_EP"/></register-group>
      <value-group caption="Interrupt level" name="USB_INTLVL">
        <value caption="Interrupt disabled" name="OFF" value="0x00"/>
        <value caption="Low level" name="LO" value="0x01"/>
        <value caption="Medium level" name="MED" value="0x02"/>
        <value caption="High level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="USB Endpoint Type" name="USB_EP_TYPE">
        <value caption="Endpoint Disabled" name="DISABLE" value="0x00"/>
        <value caption="Control" name="CONTROL" value="0x01"/>
        <value caption="Bulk/Interrupt" name="BULK" value="0x02"/>
        <value caption="Isochronous" name="ISOCHRONOUS" value="0x03"/>
      </value-group>
      <value-group caption="USB Endpoint Buffersize" name="USB_EP_BUFSIZE">
        <value caption="8 bytes buffer size" name="8" value="0x00"/>
        <value caption="16 bytes buffer size" name="16" value="0x01"/>
        <value caption="32 bytes buffer size" name="32" value="0x02"/>
        <value caption="64 bytes buffer size" name="64" value="0x03"/>
        <value caption="128 bytes buffer size" name="128" value="0x04"/>
        <value caption="256 bytes buffer size" name="256" value="0x05"/>
        <value caption="512 bytes buffer size" name="512" value="0x06"/>
        <value caption="1023 bytes buffer size" name="1023" value="0x07"/>
      </value-group>
      <interrupt-group name="USB">
        <interrupt index="0" name="BUSEVENT" caption="SOF, suspend, resume, reset bus event interrupts, crc, underflow, overflow and stall error interrupts"/>
        <interrupt index="1" name="TRNCOMPL" caption="Transaction complete interrupt"/>
      </interrupt-group>
    </module>
    <module name="PORT" id="I6075" version="XMEGAAU" caption="I/O Port Configuration">
      <register-group caption="I/O Ports" name="PORT" size="24">
        <register caption="I/O Port Data Direction" name="DIR" offset="0x00" size="1"/>
        <register caption="I/O Port Data Direction Set" name="DIRSET" offset="0x01" size="1"/>
        <register caption="I/O Port Data Direction Clear" name="DIRCLR" offset="0x02" size="1"/>
        <register caption="I/O Port Data Direction Toggle" name="DIRTGL" offset="0x03" size="1"/>
        <register caption="I/O Port Output" name="OUT" offset="0x04" size="1"/>
        <register caption="I/O Port Output Set" name="OUTSET" offset="0x05" size="1"/>
        <register caption="I/O Port Output Clear" name="OUTCLR" offset="0x06" size="1"/>
        <register caption="I/O Port Output Toggle" name="OUTTGL" offset="0x07" size="1"/>
        <register caption="I/O port Input" name="IN" offset="0x08" size="1"/>
        <register caption="Interrupt Control Register" name="INTCTRL" offset="0x09" size="1">
          <bitfield caption="Port Interrupt 1 Level" mask="0x0C" name="INT1LVL" values="PORT_INT1LVL"/>
          <bitfield caption="Port Interrupt 0 Level" mask="0x03" name="INT0LVL" values="PORT_INT0LVL"/>
        </register>
        <register caption="Port Interrupt 0 Mask" name="INT0MASK" offset="0x0A" size="1"/>
        <register caption="Port Interrupt 1 Mask" name="INT1MASK" offset="0x0B" size="1"/>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
          <bitfield caption="Port Interrupt 1 Flag" mask="0x02" name="INT1IF"/>
          <bitfield caption="Port Interrupt 0 Flag" mask="0x01" name="INT0IF"/>
        </register>
        <register caption="I/O Port Pin Remap Register" name="REMAP" offset="0x0E" size="1">
          <bitfield caption="SPI" mask="0x20" name="SPI"/>
          <bitfield caption="USART0" mask="0x10" name="USART0"/>
          <bitfield caption="Timer/Counter 0 Output Compare D" mask="0x08" name="TC0D"/>
          <bitfield caption="Timer/Counter 0 Output Compare C" mask="0x04" name="TC0C"/>
          <bitfield caption="Timer/Counter 0 Output Compare B" mask="0x02" name="TC0B"/>
          <bitfield caption="Timer/Counter 0 Output Compare A" mask="0x01" name="TC0A"/>
        </register>
        <register caption="Pin 0 Control Register" name="PIN0CTRL" offset="0x10" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 1 Control Register" name="PIN1CTRL" offset="0x11" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 2 Control Register" name="PIN2CTRL" offset="0x12" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 3 Control Register" name="PIN3CTRL" offset="0x13" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
        <register caption="Pin 4 Control Register" name="PIN4CTRL" offset="0x14" size="1">
          <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
          <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
          <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
          <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
        </register>
